Repository: Eryux/birthdaybot-discord
Catalog: i18n/*/LC_MESSAGES/locale.po
Languages: de, fr

source: Help
de: Hilfe
fr: Aide

source: All commands list and usage guide
de: Liste der Commands und Anleitungen
fr: Liste compléte des commandes et guide d'utilisation

source: Given role doesn't exists on server.
de: Diese Rolle exitiert nicht auf dem Server.
fr: Le rôle donné n'existe pas sur le serveur.

source: Members with role {0} are now allowed to use the bot.
de: Mitglieder mit der Rolle {0} drüfen den Bot nun nutzen.
fr: Les membres avec le rôle {0} sont maintenant autorisés à utiliser le bot.

source: Members with role {0} are no longer allowed to use the bot.
de: Mitglieder mit der Rolle {0} dürfen den Bot nicht mehr verwenden.
fr: Les membres avec le rôle {0} ne sont plus autorisés à utiliser le bot.

source: Members with role {0} are now allowed to manage the bot.
de: Mitglieder mit der Rolle {0} dürfen dden Bot nun verwalten.
fr: Les membres avec le rôle {0} ne sont maintenant autorisés à gérer le bot.

source: Members with role {0} are no longer allowed to manage the bot.
de: Mitglieder mit der Rolle {0} dürfen den Bot nicht mehr verwalten.
fr: Les membres avec le rôle {0} ne sont plus autorisés à gérer le bot.

source: {0} isn't a valid timezone.
de: {0} ist keine gültige Zeitzone.
fr: {0} n'est pas un fuseau horaire valide.

source: Server timezone is now {0}.
de: Die Zeitzone des Servers ist nun {0}.
fr: Le fuseau horaire du serveur est maintenant {0}.

source: {0} isn't a valid date format.
de: {0} ist kein gültiges Datumsformat.
fr: {0} n'est pas un format de date valide.

source: Server date format updated.
de: Datumsformat des Servers aktualisiert.
fr: Le format de date du serveur a été mis à jour.

source: Bot language is now english.
de: Der Bot spricht nun deutsch.
fr: La langue du bot est maintenant le français.

source: Language {0} isn't supported. ({1})
de: Die Sprache {0} wird nicht unterstützt. ({1})
fr: La langue {0} n'est pas supportée. ({1})

source: Hour must be between 0 and 23.
de: Die Stundenangabe muss zwischen 0 und 23 liegen.
fr: L'heure doit être entre 0 et 23.

source: Now we're going to celebrate birthdays at {0}.
de: Ab jetzt werden wir am {0} Geburtstagsparties feiern!
fr: Maintenant nous célébrons les anniversaires à {0}.

source: Celebration channel is now {0}.
de: Der Channel für Geburtstagsparties ist nun {0}.
fr: {0} est maintenant le salon de célébration.

source: Birthday bot message updated.
de: Birthday Bot Nachricht wurde aktualisiert.
fr: Le message d'anniversaire du bot a été mis à jour.

source: Now keeping member birthday even if member leave server.
de: Von nun an wird der Geburtstag des Mitglieds auch dann beibehalten, wenn das Mitglied den Server verlässt.
fr: Les anniversaires des membres sont maintenant conservés même s'il ont quitté le serveur.

source: Now removing member birthday when he leave server.
de: Ab jetzt wird der Geburtstag des Mitglieds entfernt, wenn er/sie/es den Server verlässt.
fr: Les anniversaires des membres sont maintenant suprimés lorsqu'il quitte le serveur.

source: Birthday role is set to {0}
de: Die Geburtstagsrolle ist auf {0} gesetzt
fr: Le rôle anniversaire est maintenant {0}.

source: Channel {0} can now be used for birthday bot.
de: Channel {0} kann nun auch für den Birthday Bot verwendet werden.
fr: Le salon {0} peut maintenant être utilisé pour le bot.

source: Channel {0} now removed from birthday bot channel.
de: Channel {0} wurde nun als Birthday Bot Channel entfernt.
fr: Le salon {0} n'est plus utilisable pour le bot.

source: Birthday isn't a valid date format: {0}.
de: Birthday ist kein gültiges Datumsformat: {0}.
fr: La date d'anniversaire n'est pas un format de date valide : {0}.

source: Birthday isn't a valid date.
de: Birthday ist kein gültiges Datumsformat.
fr: La date d'anniversaire n'est pas une date valide.

source: Your age must be between {0} and {1}.
de: Dein Alter muss zwischen {0} und {1} liegen.
fr: Votre age doit être entre {0} et {1}.

source: Given member is not a member of the server.
de: Dieses Mitglied ist kein Mitglied des Servers.
fr: Le membre n'est pas un membre du serveur.

source: {0}'s birthday is now {1}.
de: {0}'s Geburtstag ist jetzt am {1}.
fr: L'anniversaire de {0} est maintenant le {1}.

source: MMMM Do
fr: D/MM

source: {0} hasn't set is birthday yet.
de: {0} hat seinen Geburtstag noch nicht genannt.
fr: {0} n'a pas encore précisé son anniversaire.

source: {0}'s birthday removed from server.
de: {0}'s Geburtstag wurde vom Server entfernt.
fr: L'anniversaire de {0} est retiré des anniversaires du serveur.

source: {0}'s birthday is the {1} !
de: {0}'s Geburtstag ist am {1} !
fr: L'anniversaire de {0} est le {1} !

source: Connected to server since {0}.
de: Mit dem Server verbunden seit {0}.
fr: Connecté au serveur depuis {0}.

source: Authorized role(s)
de: Autorisierte Rolle(n)
fr: Rôle(s) autorisé(s)

source: Administrator role(s)
de: Administratorrolle(n)
fr: Rôle(s) administrateur(s)

source: Timezone
de: Zeitzone
fr: Fuseau horaire

source: Date format
de: Datumsformat
fr: Format de date

source: Language
de: Sprache
fr: Langage

source: Celebrating hour
de: Feierstunde
fr: Heure de célébration

source: Celebration channel
de: Channel für Geburtstagsparties
fr: Salon de célébration

source: Command channel(s)
fr: Salons des commandes

source: Birthday role
de: Birthday Rolle
fr: Rôle anniversaire

source: Keep user data
de: Benutzerdaten behalten
fr: Garder les données utilisateur

source: Last bot check
de: Letzter Bot-Check
fr: Dernier passage du bot

source: Last birthday
de: Letzter Geburtstag
fr: Dernier anniversaire

source: Happy birthday to {user} ({age}) !
fr: Joyeux anniversaire à {user} ({age}) !

source: Display help for given command. Usage: help (<command>)
de: Hilfe zu gegebenem Befehl anzeigen. So gehts: help (<command>)
fr: Affiche l'aide pour une commande donnée. Utilisation: help (<commande>)

source: Set birthday for given member. Usage: birthday <date> @<member>
de: Setze den Geburtstag für ein bestimmtes Mitglied. So gehts: birthday <date> @<member>
fr: Défini l'anniversaire pour d'un membre. Utilisation: birthday <date> @<membre>

source: Set your birthday or birthday for a given member. Usage: birthday <date> (@<member>)
de: Lege deinen Geburtstag oder den Geburtstag für ein bestimmtes Mitglied fest. So gehts: birthday <date> (@<member>)
fr: Défini votre anniversaire ou l'anniversaire pour d'un membre. Utilisation: birthday <date> (@<membre>)

source: Remove birthday of a given member. Usage: remove @<member>
de: Entferne den Geburtstag eines bestimmten Mitglieds. So gehts: remove @<member>
fr: Supprime l'anniversaire d'un membre. Utilisation: remove @<membre>

source: Remove your birthday or remove birthday of a given member. Usage: remove (@<member>)
de: Entferne deinen Geburtstag oder den Geburtstag eines bestimmten Mitglieds. So gehts: remove (@<member>)
fr: Supprime vrote date d'anniversaire ou l'anniversaire d'un membre. Utilisation: remove (@<membre>)

source: Display birthday for a given member. Usage: of @<member>
de: Zeige den Geburtstag eines bestimmten Mitglieds an. So gehts: of @<member>
fr: Affiche l'anniversaire d'un membre. Utilisation: of @<membre>

source: Allow given role to use the bot. Usage: role add <role>
de: Erlaube einer bestimmten Rolle, den Bot zu verwenden. So gehts: role add <role>
fr: Autorise un role à utiliser le bot. Utilisation: role add <role>

source: Remove right to use bot for a given role. Usage: role remove <role>
de: Entferne das Recht, den Bot für eine bestimmte Rolle zu verwenden. So gehts: role remove <role>
fr: Supprime le droit d'utiliser le bot pour un role. Utilisation: role remove <role>

source: Allow given role to manage the bot. Usage: admin-role add <role>
de: Erlaube der gegebenen Rolle, den Bot zu verwalten. So gehts: admin-role add <role>
fr: Autorise un role à gérer le bot. Utilisation: admin-role add <role>

source: Remove right to manage bot from given role. Usage: admin-role remove <role>
de: Entferne das Recht, den Bot mit der angegebenen Rolle zu verwalten. So gehts: admin-role remove <role>
fr: Supprime le droit de gérer le bot pour un role. Utilisation: admin-role remove <role>

source: Set server timezone. Usage: set-timezone <timezone>
de: Setze die Serverzeitzone. So gehts: set-timezone <timezone>
fr: Défini le fuseau horraire du serveur. Utilisation: set-timezone <fuseau>

source: Set server date format used to ask people birthday. Usage: set-dateformat <format>
de: Lege das Datumsformat des Servers fest, das verwendet wird, um den Geburtstag der Personen zu erfragen. So gehts: set-dateformat <format>
fr: Défini le format de date utilisé pour demandé l'anniversaire des personnes. Utilisation: set-dateformat <format>

source: Set server language. Usage: set-lang <lang>
de: Stelle die Serversprache ein. So gehts: set-lang <lang>
fr: Défini la langue utilisé par le bot. Utilisation: set-lang <lang>

source: Set hour at bot celebrate members birthday on server. Usage: set-celebrate-hour <hour>
de: Wähle die Stunde, an der der Bot mit den Mitgliedern Geburtstag feiert. So gehts: set-celebrate-hour <hour>
fr: Défini l'heure quand le bot célébre les anniversaires sur le serveur. Utilisation: set-celebrate-hour <hour>

source: Set channel where bot send birthday message. Usage: set-celebrate-channel #<channel>
de: Wähle den Kanal, in dem der Bot eine Geburtstagsnachricht sendet. So gehts: set-celebrate-channel #<channel>
fr: Défini le salon où le bot envoi le message d'anniversaire. Utilisation: set-celebrate-channel #<salon>

source: Set birthday message. Usage: set-birthday-message <message> Use {member} and {age} tag for displaying member name and member age in message.
de: Stelle die Geburtstagsnachricht ein. So gehts: set-birthday-message <message> Nutze die Tags {member} und {age} zur Anzeige von Mitgliedsname und Mitgliedsalter in der Nachricht.
fr: Défini le message d'anniversaire. Utilisation: set-birthday-message <message> Utiliser {member} et {age} pour afficher le nom et l'age du membre dans le message.

source: Define if we keep member birthday even if there aren't on the server. Usage: set-keep-onleave <0/1>
de: Definiere, ob wir den Geburtstag des Mitglieds behalten, auch wenn er/sie/es nicht mehr auf dem Server ist. So gehts: set-keep-onleave <0/1>
fr: Défini si on garde l'anniversaire des membres même si ils ont quittés le serveur. Utilisation: set-keep-onleave <0/1>

source: Set special role for members having birthday. Usage: set-birthday-role <role>
de: Legt eine besondere Rolle für Mitglieder fest, die Geburtstag haben. So gehts: set-birthday-role <role>
fr: Défini un role pour l'anniversaire des membres. Utilisation: set-birthday-role <role>

source: Allow given channel to be used for bot command channel from members. Usage: channel add #<channel>
de: Erlaube, dass der angegebene Kanal als Bot-Befehlskanal von Mitgliedern verwendet wird. So gehts: channel add #<channel>
fr: Autorise un salon à être utilisé pour les commandes du bot par les membres. Utilisation: channel add #<salon>

source: Remove channel from allowed bot command channel. Usage: channel remove #<channel>
de: Kanal als Bot-Befehlskanal entfernen. So gehts: channel remove #<channel>
fr: Supprime l'autorisation d'utilisé un salon pour le commande bot. Utilisation: channel remove #<channel>

source: Display fake birthday message. Usage: birthday-preview
de: Fake Geburtstagsnachricht anzeigen. So gehts: birthday-preview
fr: Affiche un faux message d'anniversaire. Utilisation: birthday-preview

source: Display bot details. Usage: status
de: Bot-Details anzeigen. So gehts: status
fr: Affiche les informations sur le bot. Utilisation: status

source: Force the bot to wish members birthdays. Usage: force-wish
de: Zwinge den Bot, wünsche zu den Geburtstagen von Mitgliedern dazulassen. So gehts: force-wish
fr: Force le bot à souhaiter les anniversaires des membres. Utilisation: force-wish

source: Stop the bot program. Usage: bot-stop
de: Stoppe das Bot-Programm. So gehts: bot-stop
fr: Arrête le programme du bot. Utilisation: bot-stop
